"use strict";
/**
 * ЗАВДАННЯ 2
 * 
 * Создай новый проект, подключи к нему файл script.js и
 * в строгом режиме выведи в консоль фразу «Я учу JS»
 * Так же напиши в комментарии какой вариант вызовет ошибку:
 * 
 */

//Варіант №1
console.log('Вчимо JS')

//Варіант №2
console.log('JS')
console.log('Вчимо')

//Варіант №3
/* console.log('Учим') console.log('JS');  - варіант с помилкою */

//Варіант №4
/* console.log('Вчимо); - варіант с помилкою  */
console.log('JS');

/**
 * ЗАВДАННЯ 3
 * 
 * 1. Придумай имя переменной для хранения цвета глаз пользователя сайта 
 * 2. Объяви две переменных - user и userName.	Присвой значение "Вася" переменной userName. 
 * Скопируй значение переменной userName в переменную user. Выведи в консоль переменную user. 
 * Результат должен быть Вася
 * 3. Напиши в комментариях какой вариант либо варианты записаны НЕ верно? 
 * 
 */

//1.
let userColourEyes;
//2.
let user;
let userName;

userName = 'Василь';
user = userName;
console.log(user);

//Варіант №1
/* let user1 = 'Вася' let age = 36; - варіант с помилкою */

//Варіант №2
let myage = 36; /* бажанно записувати в камел кейс */

//Варіант №3
const BLOCK_SIZE = 14 + 50;

//Варіант №4
const BLOCK_HEIGHT = 100;

//Варіант №5
if (true) {
    var size = 15;
}
console.log(size);

/**
 * ЗАВДАННЯ 4
 * 
 * Які з варіантів не вірні
 */

//Варіант №1
let userAge = 36;
/* let userInfo = "Фрилансер ${userAge}"; - Не вірно. */

//Варіант №2
let userHeight = 145 / 0;
// поверне - NaN
console.log(userHeight); /*  Не вірно. Поверне безкінечність -Infinity */

//Варіант №3

let userName1;
// Поверне - Null
console.log(userName1); /* Не вірно. Поверне не задану перемінну - undefined */

//Варіант №4

let userSize = "45" / "8";
// Поверне - Number
console.log(typeof userSize) /* Вірно. Поверне тип данних число - Number */